; domain
(define (domain p1)
(:requirements :strips :typing)

(:types 
    location 
    crate 
    content
    person
    drone
    arm
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (is-injured ?person - person)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (person-need ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (has-crate-drone-arm ?drone - drone ?arm - arm ?crate - crate)
    (empty-arm ?drone - drone ?arm - arm)
)

(:action pick-up-crate
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?arm - arm
    )
    :precondition (and 
        (empty-arm ?drone ?arm)                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)           
    )
    :effect (and
        (has-crate-drone-arm ?drone ?arm ?crate)     
        (not (empty-arm ?drone ?arm))           
        (not (crate-at ?crate ?location))     
    )
)

(:action drone-move
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
    )
    :precondition (and 
        (drone-at ?drone ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from)) 
        (drone-at ?drone ?location_to)         
    )
)

(:action drop-crate
    :parameters (
        ?location - location
        ?person - person
        ?crate - crate
        ?arm - arm
        ?content - content
        ?drone - drone
    )
    :precondition (and 
        (person-at ?person ?location)     
        (drone-at ?drone ?location)       
        (has-crate-drone-arm ?drone ?arm ?crate)     
        (content-crate ?content ?crate)       
        (person-need ?person ?content)    
    )
    :effect (and 
        (not (has-crate-drone-arm ?drone ?arm ?crate))   
        (has-content-person ?person ?content) 
        (empty-arm ?drone ?arm)                      
)
)
)

; problem
(define (problem drone_problem_d1_r0_l25_p25_c25_g25_ct2)
(:domain p1)
(:objects
	drone1 - drone
	depot - location
	warehouse - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	loc20 - location
	loc21 - location
	loc22 - location
	loc23 - location
	loc24 - location
	loc25 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	crate19 - crate
	crate20 - crate
	crate21 - crate
	crate22 - crate
	crate23 - crate
	crate24 - crate
	crate25 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	person24 - person
	person25 - person
	left right - arm
)
(:init
	(drone-at drone1 depot)
	(crate-at crate1 warehouse)
	(crate-at crate2 warehouse)
	(crate-at crate3 warehouse)
	(crate-at crate4 warehouse)
	(crate-at crate5 warehouse)
	(crate-at crate6 warehouse)
	(crate-at crate7 warehouse)
	(crate-at crate8 warehouse)
	(crate-at crate9 warehouse)
	(crate-at crate10 warehouse)
	(crate-at crate11 warehouse)
	(crate-at crate12 warehouse)
	(crate-at crate13 warehouse)
	(crate-at crate14 warehouse)
	(crate-at crate15 warehouse)
	(crate-at crate16 warehouse)
	(crate-at crate17 warehouse)
	(crate-at crate18 warehouse)
	(crate-at crate19 warehouse)
	(crate-at crate20 warehouse)
	(crate-at crate21 warehouse)
	(crate-at crate22 warehouse)
	(crate-at crate23 warehouse)
	(crate-at crate24 warehouse)
	(crate-at crate25 warehouse)
	(empty-arm drone1 left)
	(empty-arm drone1 right)
	(content-crate food crate1)
	(content-crate food crate2)
	(content-crate food crate3)
	(content-crate food crate4)
	(content-crate food crate5)
	(content-crate food crate6)
	(content-crate food crate7)
	(content-crate food crate8)
	(content-crate food crate9)
	(content-crate food crate10)
	(content-crate food crate11)
	(content-crate food crate12)
	(content-crate food crate13)
	(content-crate food crate14)
	(content-crate food crate15)
	(content-crate food crate16)
	(content-crate food crate17)
	(content-crate food crate18)
	(content-crate medicine crate19)
	(content-crate medicine crate20)
	(content-crate medicine crate21)
	(content-crate medicine crate22)
	(content-crate medicine crate23)
	(content-crate medicine crate24)
	(content-crate medicine crate25)
	(person-at person1 loc8)
	(person-at person2 loc16)
	(person-at person3 loc2)
	(person-at person4 loc10)
	(person-at person5 loc14)
	(person-at person6 loc15)
	(person-at person7 loc8)
	(person-at person8 loc8)
	(person-at person9 loc25)
	(person-at person10 loc13)
	(person-at person11 loc7)
	(person-at person12 loc2)
	(person-at person13 loc13)
	(person-at person14 loc12)
	(person-at person15 loc12)
	(person-at person16 loc23)
	(person-at person17 loc6)
	(person-at person18 loc1)
	(person-at person19 loc6)
	(person-at person20 loc8)
	(person-at person21 loc8)
	(person-at person22 loc12)
	(person-at person23 loc23)
	(person-at person24 loc3)
	(person-at person25 loc23)
	(person-need person1 food)
	(person-need person1 medicine)
	(person-need person3 food)
	(person-need person5 food)
	(person-need person6 food)
	(person-need person7 food)
	(person-need person8 food)
	(person-need person9 food)
	(person-need person10 food)
	(person-need person11 medicine)
	(person-need person12 medicine)
	(person-need person13 food)
	(person-need person14 food)
	(person-need person15 food)
	(person-need person16 food)
	(person-need person19 food)
	(person-need person19 medicine)
	(person-need person20 food)
	(person-need person20 medicine)
	(person-need person21 medicine)
	(person-need person22 food)
	(person-need person23 food)
	(person-need person24 food)
	(person-need person25 food)
	(person-need person25 medicine)
)
(:goal (and
	(drone-at drone1 depot)
	(has-content-person person1 food)
	(has-content-person person1 medicine)
	(has-content-person person3 food)
	(has-content-person person5 food)
	(has-content-person person6 food)
	(has-content-person person7 food)
	(has-content-person person8 food)
	(has-content-person person9 food)
	(has-content-person person10 food)
	(has-content-person person11 medicine)
	(has-content-person person12 medicine)
	(has-content-person person13 food)
	(has-content-person person14 food)
	(has-content-person person15 food)
	(has-content-person person16 food)
	(has-content-person person19 food)
	(has-content-person person19 medicine)
	(has-content-person person20 food)
	(has-content-person person20 medicine)
	(has-content-person person21 medicine)
	(has-content-person person22 food)
	(has-content-person person23 food)
	(has-content-person person24 food)
	(has-content-person person25 food)
	(has-content-person person25 medicine)
))
)

; plan
1. (drone-move depot warehouse drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 warehouse)
   goals met: 0 of 26
2. (pick-up-crate crate1 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate1 warehouse)
   added: (has-crate-drone-arm drone1 right crate1)
   goals met: 0 of 26
3. (pick-up-crate crate19 warehouse drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate19 warehouse)
   added: (has-crate-drone-arm drone1 left crate19)
   goals met: 0 of 26
4. (drone-move warehouse loc14 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc14)
   goals met: 0 of 26
5. (drop-crate loc14 person5 crate1 right food drone1)
   deleted: (has-crate-drone-arm drone1 right crate1)
   added: (has-content-person person5 food) (empty-arm drone1 right)
   goals met: 1 of 26
6. (drone-move loc14 warehouse drone1)
   deleted: (drone-at drone1 loc14)
   added: (drone-at drone1 warehouse)
   goals met: 1 of 26
7. (pick-up-crate crate2 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate2 warehouse)
   added: (has-crate-drone-arm drone1 right crate2)
   goals met: 1 of 26
8. (drone-move warehouse loc15 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc15)
   goals met: 1 of 26
9. (drop-crate loc15 person6 crate2 right food drone1)
   deleted: (has-crate-drone-arm drone1 right crate2)
   added: (has-content-person person6 food) (empty-arm drone1 right)
   goals met: 2 of 26
10. (drone-move loc15 warehouse drone1)
   deleted: (drone-at drone1 loc15)
   added: (drone-at drone1 warehouse)
   goals met: 2 of 26
11. (pick-up-crate crate3 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate3 warehouse)
   added: (has-crate-drone-arm drone1 right crate3)
   goals met: 2 of 26
12. (drone-move warehouse loc25 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc25)
   goals met: 2 of 26
13. (drop-crate loc25 person9 crate3 right food drone1)
   deleted: (has-crate-drone-arm drone1 right crate3)
   added: (has-content-person person9 food) (empty-arm drone1 right)
   goals met: 3 of 26
14. (drone-move loc25 warehouse drone1)
   deleted: (drone-at drone1 loc25)
   added: (drone-at drone1 warehouse)
   goals met: 3 of 26
15. (pick-up-crate crate4 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate4 warehouse)
   added: (has-crate-drone-arm drone1 right crate4)
   goals met: 3 of 26
16. (drone-move warehouse loc7 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc7)
   goals met: 3 of 26
17. (drop-crate loc7 person11 crate19 left medicine drone1)
   deleted: (has-crate-drone-arm drone1 left crate19)
   added: (has-content-person person11 medicine) (empty-arm drone1 left)
   goals met: 4 of 26
18. (drone-move loc7 warehouse drone1)
   deleted: (drone-at drone1 loc7)
   added: (drone-at drone1 warehouse)
   goals met: 4 of 26
19. (pick-up-crate crate20 warehouse drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate20 warehouse)
   added: (has-crate-drone-arm drone1 left crate20)
   goals met: 4 of 26
20. (drone-move warehouse loc2 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc2)
   goals met: 4 of 26
21. (drone-move loc2 loc3 drone1)
   deleted: (drone-at drone1 loc2)
   added: (drone-at drone1 loc3)
   goals met: 4 of 26
22. (drop-crate loc3 person24 crate4 right food drone1)
   deleted: (has-crate-drone-arm drone1 right crate4)
   added: (has-content-person person24 food) (empty-arm drone1 right)
   goals met: 5 of 26
23. (drone-move loc3 warehouse drone1)
   deleted: (drone-at drone1 loc3)
   added: (drone-at drone1 warehouse)
   goals met: 5 of 26
24. (pick-up-crate crate5 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate5 warehouse)
   added: (has-crate-drone-arm drone1 right crate5)
   goals met: 5 of 26
25. (drone-move warehouse loc2 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc2)
   goals met: 5 of 26
26. (drop-crate loc2 person3 crate5 right food drone1)
   deleted: (has-crate-drone-arm drone1 right crate5)
   added: (has-content-person person3 food) (empty-arm drone1 right)
   goals met: 6 of 26
27. (drone-move loc2 warehouse drone1)
   deleted: (drone-at drone1 loc2)
   added: (drone-at drone1 warehouse)
   goals met: 6 of 26
28. (pick-up-crate crate6 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate6 warehouse)
   added: (has-crate-drone-arm drone1 right crate6)
   goals met: 6 of 26
29. (drone-move warehouse loc2 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc2)
   goals met: 6 of 26
30. (drop-crate loc2 person12 crate20 left medicine drone1)
   deleted: (has-crate-drone-arm drone1 left crate20)
   added: (has-content-person person12 medicine) (empty-arm drone1 left)
   goals met: 7 of 26
31. (drone-move loc2 warehouse drone1)
   deleted: (drone-at drone1 loc2)
   added: (drone-at drone1 warehouse)
   goals met: 7 of 26
32. (pick-up-crate crate21 warehouse drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate21 warehouse)
   added: (has-crate-drone-arm drone1 left crate21)
   goals met: 7 of 26
33. (drone-move warehouse loc13 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc13)
   goals met: 7 of 26
34. (drop-crate loc13 person10 crate6 right food drone1)
   deleted: (has-crate-drone-arm drone1 right crate6)
   added: (has-content-person person10 food) (empty-arm drone1 right)
   goals met: 8 of 26
35. (drone-move loc13 warehouse drone1)
   deleted: (drone-at drone1 loc13)
   added: (drone-at drone1 warehouse)
   goals met: 8 of 26
36. (pick-up-crate crate7 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate7 warehouse)
   added: (has-crate-drone-arm drone1 right crate7)
   goals met: 8 of 26
37. (drone-move warehouse loc13 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc13)
   goals met: 8 of 26
38. (drop-crate loc13 person13 crate7 right food drone1)
   deleted: (has-crate-drone-arm drone1 right crate7)
   added: (has-content-person person13 food) (empty-arm drone1 right)
   goals met: 9 of 26
39. (drone-move loc13 warehouse drone1)
   deleted: (drone-at drone1 loc13)
   added: (drone-at drone1 warehouse)
   goals met: 9 of 26
40. (pick-up-crate crate8 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate8 warehouse)
   added: (has-crate-drone-arm drone1 right crate8)
   goals met: 9 of 26
41. (drone-move warehouse loc6 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc6)
   goals met: 9 of 26
42. (drop-crate loc6 person19 crate8 right food drone1)
   deleted: (has-crate-drone-arm drone1 right crate8)
   added: (has-content-person person19 food) (empty-arm drone1 right)
   goals met: 10 of 26
43. (drone-move loc6 warehouse drone1)
   deleted: (drone-at drone1 loc6)
   added: (drone-at drone1 warehouse)
   goals met: 10 of 26
44. (pick-up-crate crate9 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate9 warehouse)
   added: (has-crate-drone-arm drone1 right crate9)
   goals met: 10 of 26
45. (drone-move warehouse loc6 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc6)
   goals met: 10 of 26
46. (drop-crate loc6 person19 crate21 left medicine drone1)
   deleted: (has-crate-drone-arm drone1 left crate21)
   added: (has-content-person person19 medicine) (empty-arm drone1 left)
   goals met: 11 of 26
47. (drone-move loc6 warehouse drone1)
   deleted: (drone-at drone1 loc6)
   added: (drone-at drone1 warehouse)
   goals met: 11 of 26
48. (pick-up-crate crate22 warehouse drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate22 warehouse)
   added: (has-crate-drone-arm drone1 left crate22)
   goals met: 11 of 26
49. (drone-move warehouse loc8 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc8)
   goals met: 11 of 26
50. (drop-crate loc8 person1 crate9 right food drone1)
   deleted: (has-crate-drone-arm drone1 right crate9)
   added: (has-content-person person1 food) (empty-arm drone1 right)
   goals met: 12 of 26
51. (drone-move loc8 warehouse drone1)
   deleted: (drone-at drone1 loc8)
   added: (drone-at drone1 warehouse)
   goals met: 12 of 26
52. (pick-up-crate crate10 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate10 warehouse)
   added: (has-crate-drone-arm drone1 right crate10)
   goals met: 12 of 26
53. (drone-move warehouse loc8 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc8)
   goals met: 12 of 26
54. (drop-crate loc8 person1 crate22 left medicine drone1)
   deleted: (has-crate-drone-arm drone1 left crate22)
   added: (has-content-person person1 medicine) (empty-arm drone1 left)
   goals met: 13 of 26
55. (drone-move loc8 warehouse drone1)
   deleted: (drone-at drone1 loc8)
   added: (drone-at drone1 warehouse)
   goals met: 13 of 26
56. (pick-up-crate crate23 warehouse drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate23 warehouse)
   added: (has-crate-drone-arm drone1 left crate23)
   goals met: 13 of 26
57. (drone-move warehouse loc8 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc8)
   goals met: 13 of 26
58. (drop-crate loc8 person7 crate10 right food drone1)
   deleted: (has-crate-drone-arm drone1 right crate10)
   added: (has-content-person person7 food) (empty-arm drone1 right)
   goals met: 14 of 26
59. (drone-move loc8 warehouse drone1)
   deleted: (drone-at drone1 loc8)
   added: (drone-at drone1 warehouse)
   goals met: 14 of 26
60. (pick-up-crate crate11 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate11 warehouse)
   added: (has-crate-drone-arm drone1 right crate11)
   goals met: 14 of 26
61. (drone-move warehouse loc8 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc8)
   goals met: 14 of 26
62. (drop-crate loc8 person8 crate11 right food drone1)
   deleted: (has-crate-drone-arm drone1 right crate11)
   added: (has-content-person person8 food) (empty-arm drone1 right)
   goals met: 15 of 26
63. (drone-move loc8 warehouse drone1)
   deleted: (drone-at drone1 loc8)
   added: (drone-at drone1 warehouse)
   goals met: 15 of 26
64. (pick-up-crate crate12 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate12 warehouse)
   added: (has-crate-drone-arm drone1 right crate12)
   goals met: 15 of 26
65. (drone-move warehouse loc8 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc8)
   goals met: 15 of 26
66. (drop-crate loc8 person20 crate12 right food drone1)
   deleted: (has-crate-drone-arm drone1 right crate12)
   added: (has-content-person person20 food) (empty-arm drone1 right)
   goals met: 16 of 26
67. (drone-move loc8 warehouse drone1)
   deleted: (drone-at drone1 loc8)
   added: (drone-at drone1 warehouse)
   goals met: 16 of 26
68. (pick-up-crate crate13 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate13 warehouse)
   added: (has-crate-drone-arm drone1 right crate13)
   goals met: 16 of 26
69. (drone-move warehouse loc8 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc8)
   goals met: 16 of 26
70. (drop-crate loc8 person20 crate23 left medicine drone1)
   deleted: (has-crate-drone-arm drone1 left crate23)
   added: (has-content-person person20 medicine) (empty-arm drone1 left)
   goals met: 17 of 26
71. (drone-move loc8 warehouse drone1)
   deleted: (drone-at drone1 loc8)
   added: (drone-at drone1 warehouse)
   goals met: 17 of 26
72. (pick-up-crate crate24 warehouse drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate24 warehouse)
   added: (has-crate-drone-arm drone1 left crate24)
   goals met: 17 of 26
73. (drone-move warehouse loc8 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc8)
   goals met: 17 of 26
74. (drop-crate loc8 person21 crate24 left medicine drone1)
   deleted: (has-crate-drone-arm drone1 left crate24)
   added: (has-content-person person21 medicine) (empty-arm drone1 left)
   goals met: 18 of 26
75. (drone-move loc8 warehouse drone1)
   deleted: (drone-at drone1 loc8)
   added: (drone-at drone1 warehouse)
   goals met: 18 of 26
76. (pick-up-crate crate25 warehouse drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate25 warehouse)
   added: (has-crate-drone-arm drone1 left crate25)
   goals met: 18 of 26
77. (drone-move warehouse loc12 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc12)
   goals met: 18 of 26
78. (drone-move loc12 loc23 drone1)
   deleted: (drone-at drone1 loc12)
   added: (drone-at drone1 loc23)
   goals met: 18 of 26
79. (drop-crate loc23 person25 crate25 left medicine drone1)
   deleted: (has-crate-drone-arm drone1 left crate25)
   added: (has-content-person person25 medicine) (empty-arm drone1 left)
   goals met: 19 of 26
80. (drop-crate loc23 person16 crate13 right food drone1)
   deleted: (has-crate-drone-arm drone1 right crate13)
   added: (has-content-person person16 food) (empty-arm drone1 right)
   goals met: 20 of 26
81. (drone-move loc23 warehouse drone1)
   deleted: (drone-at drone1 loc23)
   added: (drone-at drone1 warehouse)
   goals met: 20 of 26
82. (pick-up-crate crate14 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate14 warehouse)
   added: (has-crate-drone-arm drone1 right crate14)
   goals met: 20 of 26
83. (drone-move warehouse loc12 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc12)
   goals met: 20 of 26
84. (drop-crate loc12 person14 crate14 right food drone1)
   deleted: (has-crate-drone-arm drone1 right crate14)
   added: (has-content-person person14 food) (empty-arm drone1 right)
   goals met: 21 of 26
85. (drone-move loc12 warehouse drone1)
   deleted: (drone-at drone1 loc12)
   added: (drone-at drone1 warehouse)
   goals met: 21 of 26
86. (pick-up-crate crate15 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate15 warehouse)
   added: (has-crate-drone-arm drone1 right crate15)
   goals met: 21 of 26
87. (drone-move warehouse loc12 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc12)
   goals met: 21 of 26
88. (drop-crate loc12 person15 crate15 right food drone1)
   deleted: (has-crate-drone-arm drone1 right crate15)
   added: (has-content-person person15 food) (empty-arm drone1 right)
   goals met: 22 of 26
89. (drone-move loc12 warehouse drone1)
   deleted: (drone-at drone1 loc12)
   added: (drone-at drone1 warehouse)
   goals met: 22 of 26
90. (pick-up-crate crate16 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate16 warehouse)
   added: (has-crate-drone-arm drone1 right crate16)
   goals met: 22 of 26
91. (drone-move warehouse loc12 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc12)
   goals met: 22 of 26
92. (drop-crate loc12 person22 crate16 right food drone1)
   deleted: (has-crate-drone-arm drone1 right crate16)
   added: (has-content-person person22 food) (empty-arm drone1 right)
   goals met: 23 of 26
93. (drone-move loc12 warehouse drone1)
   deleted: (drone-at drone1 loc12)
   added: (drone-at drone1 warehouse)
   goals met: 23 of 26
94. (pick-up-crate crate17 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate17 warehouse)
   added: (has-crate-drone-arm drone1 right crate17)
   goals met: 23 of 26
95. (drone-move warehouse loc23 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc23)
   goals met: 23 of 26
96. (drop-crate loc23 person23 crate17 right food drone1)
   deleted: (has-crate-drone-arm drone1 right crate17)
   added: (has-content-person person23 food) (empty-arm drone1 right)
   goals met: 24 of 26
97. (drone-move loc23 warehouse drone1)
   deleted: (drone-at drone1 loc23)
   added: (drone-at drone1 warehouse)
   goals met: 24 of 26
98. (pick-up-crate crate18 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate18 warehouse)
   added: (has-crate-drone-arm drone1 right crate18)
   goals met: 24 of 26
99. (drone-move warehouse loc23 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc23)
   goals met: 24 of 26
100. (drop-crate loc23 person25 crate18 right food drone1)
   deleted: (has-crate-drone-arm drone1 right crate18)
   added: (has-content-person person25 food) (empty-arm drone1 right)
   goals met: 25 of 26
101. (drone-move loc23 depot drone1)
   deleted: (drone-at drone1 loc23)
   added: (drone-at drone1 depot)
   goals met: 26 of 26
